FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_EMAC.c
    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 30; timeout++) {
#if DEBUG_LPC1788_EMAC_STARTUP
        printf(".");
#endif
        UEZBSPDelayMS(100);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & (BMSR_AUTO_DONE | BMSR_LINK_ESTABLISHED)) {
            // Autonegotiation Complete.
            break;
        }
    }

    regv = IPHYRead(p, MIC_PHY_100BASE_PHY_CTRL);
#if DEBUG_LPC1788_EMAC_STARTUP
    printf("nego regv %04X\n", regv);
#endif
    // successful negotiations; update link info
    regv &= 0x001C;
    switch (regv) {
        case 0x0004:
            // Half duplex mode.
            LPC_EMAC->IPGT = IPGT_HALF_DUP;
            // 10MBit mode.
            LPC_EMAC->SUPP = 0;
            break;
        case 0x0008:
            // Half duplex mode.
            LPC_EMAC->IPGT = IPGT_HALF_DUP;
            // 100MBit mode.
            LPC_EMAC->SUPP = SUPP_SPEED;
            break;
        case 0x0014:
            // Full duplex is enabled.
            LPC_EMAC->MAC2 |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT = IPGT_FULL_DUP;
            // 10MBit mode.
            LPC_EMAC->SUPP = 0;
            break;
        case 0x0018:
            // Full duplex is enabled.
            LPC_EMAC->MAC2 |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT = IPGT_FULL_DUP;
            // 100MBit mode.
            LPC_EMAC->SUPP = SUPP_SPEED;
            break;
        default: // Should not come here, force to set default, 100 FULL_DUPLEX
            // Full duplex is enabled.
            LPC_EMAC->MAC2 |= MAC2_FULL_DUP;
            LPC_EMAC->Command |= CR_FULL_DUP;
            LPC_EMAC->IPGT = IPGT_FULL_DUP;
            // 100MBit mode.
            LPC_EMAC->SUPP = SUPP_SPEED;
            break;
    }

#if DEBUG_LPC1788_EMAC_STARTUP
    for (reg = 0; reg < 32; reg++) {
        regv = IPHYRead(p, reg);
        printf("phyreg %d = %04X\n", reg, regv);
    }
#endif

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1788_EMAC_InitRxDescriptors
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize Receive Descriptors
 *---------------------------------------------------------------------------*/
static void ILPC1788_EMAC_InitRxDescriptors(void)
{
    TUInt32 i;

    for (i = 0; i < NUM_RX_FRAG; i++) {
        RX_DESC_PACKET(i) = RX_BUF(i);
        RX_DESC_CTRL(i) = RCTRL_INT | (ETH_FRAG_SIZE - 1);
        RX_STAT_INFO(i) = 0;
        RX_STAT_HASHCRC(i) = 0;
    }

    // Set EMAC Receive Descriptor Registers.
    LPC_EMAC->RxDescriptor = RX_DESC_BASE;
    LPC_EMAC->RxStatus = RX_STAT_BASE;
    LPC_EMAC->RxDescriptorNumber = NUM_RX_FRAG - 1;

    /* Rx Descriptors Point to 0 */
    LPC_EMAC->RxConsumeIndex = 0;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1788_EMAC_InitTxDescriptors
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize Transmit Descriptors
 *---------------------------------------------------------------------------*/
void ILPC1788_EMAC_InitTxDescriptors(void)
{
    TUInt32 i;

    for (i = 0; i < NUM_TX_FRAG; i++) {
        TX_DESC_PACKET(i) = TX_BUF(i);
        TX_DESC_CTRL(i) = 0;
        TX_STAT_INFO(i) = 0;
    }

    /* Set EMAC Transmit Descriptor Registers. */
    LPC_EMAC->TxDescriptor = TX_DESC_BASE;
    LPC_EMAC->TxStatus = TX_STAT_BASE;
    LPC_EMAC->TxDescriptorNumber = NUM_TX_FRAG - 1;

    /* Tx Descriptors Point to 0 */
    LPC_EMAC->TxProduceIndex = 0;
}
/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this EMAC Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_EMAC_InitializeWorkspace(void *aWorkspace)
{
    //    T_LPC1788_EMAC_Workspace *p = (T_LPC1788_EMAC_Workspace *)aWorkspace;

    // Nothing in this case
    G_LPC1788_EMAC = aWorkspace;
    G_LPC1788_EMAC->iIsDetected = EFalse;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_DetectEMAC
 *---------------------------------------------------------------------------*
 * Description:
 *      Detect if the EMAC can be found at all.
 * Inputs:
 *      T_LPC1788_EMAC_Workspace *p -- Workspace
 * Outputs:
 *      T_uezError                 -- Error code of UEZ_ERROR_NOT_FOUND if
 *                                    not detected, else UEZ_ERROR_NONE
 *---------------------------------------------------------------------------*/
#if EMAC_USE_BITBANG_MDIO_DETECT
static T_uezError LPC1788_EMAC_DetectEMAC(T_LPC1788_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NOT_FOUND;
    T_uezGPIOPortPin pinMDC = p->iPinSettings.iMDC;
    T_uezGPIOPortPin pinMDIO = p->iPinSettings.iMDIO;
    T_gpioMux pinMDCMux;
    T_gpioMux pinMDIOMux;
    TUInt32 n;
    TUInt32 v;
    T_mdioBitBangSettings mdio;

    // Check that the MDIO lines are available
    if ((pinMDC != GPIO_NONE) && (pinMDIO != GPIO_NONE)) {
        // Remember what the settings of these pins were
        UEZGPIOGetMux(pinMDC, &pinMDCMux);
        UEZGPIOGetMux(pinMDIO, &pinMDIOMux);

        // Set the signals to high
        UEZGPIOSet(pinMDC);
        UEZGPIOSet(pinMDIO);
        UEZGPIOSetMux(pinMDC, 0);
        UEZGPIOSetMux(pinMDIO, 0);

        mdio.iDelayUSPerHalfBit = 50;// 50 uS per half, kind of slow
        mdio.iIsClause45 = EFalse;
        mdio.iPinMDC = pinMDC;
        mdio.iPinMDIO = pinMDIO;

        for (n=0; n<32; n++) {
#if DEBUG_LPC1788_EMAC_STARTUP
            printf("LPC1788_EMAC_DetectEMAC: PHY %d, Reg 2 = ", n);
#endif
            v = MDIOBitBangRead(&mdio, n, 0x0002);
#if DEBUG_LPC1788_EMAC_STARTUP
            printf("%04X\n", v);
#endif
            if (v != 0xFFFF) {
                error = UEZ_ERROR_NONE;
                break;
            }
        }

        // Put the settings back
        UEZGPIOSetMux(pinMDC, pinMDCMux);
        UEZGPIOSetMux(pinMDIO, pinMDIOMux);
    }

    return error;
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure and setup the EMAC screen with the given settings
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *      T_EMACSettings *aSettings -- Pointer to settings to use
 * Outputs:
 *      T_uezError                -- Error code.  Returns UEZ_ERROR_NOT_FOUND
 *                                  if PHY not connected.
 *---------------------------------------------------------------------------*/
T_uezError LPC1788_EMAC_Configure(void *aWorkspace, T_EMACSettings *aSettings)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_LPC1788_EMAC_Workspace *p = (T_LPC1788_EMAC_Workspace *)aWorkspace;
    TUInt32 regv, timeout;
    TUInt32 retry;
    TUInt32 addr = 1;
    TUInt32 uniqueID;
#if 1
    TUInt16 v;
#endif

    // Because the LPC1788 has a problem with EMAC's that are missing,
    // we will detect the EMAC using bit bang I2C
    // Don't allow this if not detected
    if (!p->iIsDetected)
        return UEZ_ERROR_NOT_FOUND;

    // Copy over the settings
    p->iSettings = *aSettings;

    // Shift the phy address now to make the calculations faster
    p->iSettings.iPHYAddr <<= 8;

    // Initializes the EMAC ethernet controller
    // Ensure EMAC is powered up
    //LPC_SC->PCONP |= 0x40000000;
    LPC1788PowerOn(0x40000000);

    // Delay a small amount
    UEZBSPDelayMS(1);

