FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_EMAC.c
    // Reset all EMAC internal modules.
    // TBD: Should we use rx and tx flow control since we might be running too slow
    LPC_EMAC->MAC1 =
        MAC1_RES_TX | MAC1_RES_MCS_TX | MAC1_RES_RX | MAC1_RES_MCS_RX
            | MAC1_SIM_RES | MAC1_SOFT_RES /*| MAC1_RX_FLOWC | MAC1_TX_FLOWC*/;
    LPC_EMAC->Command = CR_REG_RES | CR_TX_RES | CR_RX_RES;

    // A short delay after reset.
    UEZBSPDelayMS(1);

    // Initialize MAC control registers.
    LPC_EMAC->MAC1 = MAC1_PASS_ALL;
    LPC_EMAC->MAC2 = MAC2_CRC_EN | MAC2_PAD_EN;
    LPC_EMAC->MAXF = ETH_MAX_FLEN;
    LPC_EMAC->CLRT = CLRT_DEF;
    LPC_EMAC->IPGR = IPGR_DEF;

    // host clock divided by 28, no suppress preamble, no scan increment
    // TBD: Should this be calculated at run time?
    LPC_EMAC->MCFG = 0x801C;
    UEZBSPDelayMS(1);

    // Apply a reset
    LPC_EMAC->MCFG = 0x0018;
    LPC_EMAC->MCMD = 0;

    // RMII configuration
    LPC_EMAC->Command |= CR_RMII;

    // PHY support: [8]=0 ->10 Mbps mode, =1 -> 100 Mbps mode
    // RMII setting, at power-on, default set to 100.
    LPC_EMAC->SUPP = SUPP_SPEED;

    UEZBSPDelayMS(500);

    // Find the PHY address
    for (addr = 0; addr < 16; addr++) {
        p->iSettings.iPHYAddr = addr << 8;
        v = IPHYRead(p, PHY_REG_IDR1);
#if DEBUG_LPC1788_EMAC_STARTUP
        printf("ADDR: %d, v=%04X\n", addr, v);
#endif
        if (v != 0xFFFF) {
            break;
        }
    }
#if DEBUG_LPC1788_EMAC_STARTUP
    printf("Addr: %d, Settings: %08X\n", addr, p->iSettings.iPHYAddr);
#endif

    /* Put the Phy in reset mode */
    IPHYWrite(p, PHY_REG_BMCR, 0x8000);
    UEZBSPDelayMS(1);

    // Wait for hardware reset to end.
    // We try 100 times with a 10 ms delay for a complete
    // time of 1 second.
    retry = 3;
    do {
        for (timeout = 0; timeout < 100; timeout++) {
            UEZBSPDelayMS(10);
            regv = IPHYRead(p, PHY_REG_BMCR);
            if (!(regv & 0x8000)) {
                // Reset complete
                break;
            }
        }
#if DEBUG_LPC1788_EMAC_STARTUP
        printf("regv=%04X\n", regv);
#endif
    } while ((timeout == 100) && (--retry));

    if (!retry) {
        // report a timeout on the initialization
        return UEZ_ERROR_TIMEOUT;
    }

    // Setup PAUSE control (PAUSE and ASM_DIR in ANAR register)
    regv = IPHYRead(p, PHY_REG_ANAR);
#if DEBUG_LPC1788_EMAC_STARTUP
    printf("pause regv=%04X\n", regv);
#endif
    IPHYWrite(p, PHY_REG_ANAR, regv | (1 << 10) | (1 << 11));

    uniqueID = (IPHYRead(p, PHY_REG_IDR1) << 16) | IPHYRead(p, PHY_REG_IDR2);
#if DEBUG_LPC1788_EMAC_STARTUP
    printf("PHY ID: %08X\n", uniqueID);
#endif

    switch (uniqueID) {
        case 0x20005C90: // National PHY
            error = IEMACConfigPHY_National(p);
            break;
        case 0x00221610: // Micrel
        case 0x00221512: // Micrel KSZ8041TL-FTL
        case 0x00221513: // Micrel KSZ8041NL
        case 0x00221555: //Micrel KSZ8051
#if DEBUG_LPC1788_EMAC_STARTUP
            printf("Micrel init\n");
#endif
            error = IEMACConfigPHY_Micrel(p);
            break;
        case 0x0007C0F1: // SMSC LAN8720
        case 0x000740F1: // SMSC LAN8720 (optional other ID)
#if DEBUG_LPC1788_EMAC_STARTUP
            printf("SMSC LAN8720 init\n");
#endif
            // Uses same initialization as Micrel
            error = IEMACConfigPHY_Micrel(p);
            break;
        default:
            // auto negotiation, restart AN
            // RE_AN should be self cleared
            IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);
#if DEBUG_LPC1788_EMAC_STARTUP
            printf("Unknown PHY: %08X\n", uniqueID);
#endif
            return UEZ_ERROR_NOT_SUPPORTED;
    }

    LPC_EMAC->SA0 = (p->iSettings.iMACAddress[5] << 8)
        | p->iSettings.iMACAddress[4];
    LPC_EMAC->SA1 = (p->iSettings.iMACAddress[3] << 8)
        | p->iSettings.iMACAddress[2];
    LPC_EMAC->SA2 = (p->iSettings.iMACAddress[1] << 8)
        | p->iSettings.iMACAddress[0];

    // Initialize Tx and Rx DMA Descriptors
    ILPC1788_EMAC_InitRxDescriptors();
    ILPC1788_EMAC_InitTxDescriptors();

    // Receive Broadcast and Perfect Match Packets
    //Ake changed, RFC_UCAST_EN seems to be incorrect.
    //RxFilterCtrl = RFC_UCAST_EN | RFC_BCAST_EN | RFC_PERFECT_EN;
    LPC_EMAC->RxFilterCtrl = RFC_BCAST_EN | RFC_PERFECT_EN;

    // Create the semaphore used ot wake the uIP task.
    //??    vSemaphoreCreateBinary( xEMACSemaphore );

    // Reset all interrupts
    LPC_EMAC->IntClear = 0xFFFF;

    /* Enable receive and transmit mode of MAC Ethernet core */
    LPC_EMAC->Command |= (CR_RX_EN | CR_TX_EN);
    LPC_EMAC->MAC1 |= MAC1_REC_EN;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_CheckFrameReceived
 *---------------------------------------------------------------------------*
 * Description:
 *      Determine if a frame has been received.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TBool                     -- ETrue if frame received, else EFalse.
 *---------------------------------------------------------------------------*/
TBool LPC1788_EMAC_CheckFrameReceived(void *aWorkspace)
{
    // more packets received ?
    if (LPC_EMAC->RxProduceIndex != LPC_EMAC->RxConsumeIndex)
        return ETrue;
    return EFalse;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_StartReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Reads the length of the received ethernet frame.  Returns the
 *      frame length.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TUInt16                   -- Size of frame
 *---------------------------------------------------------------------------*/
TUInt16 LPC1788_EMAC_StartReadFrame(void *aWorkspace)
{
    TUInt16 RxLen;
    TUInt32 idx;
    T_LPC1788_EMAC_Workspace *p = (T_LPC1788_EMAC_Workspace *)aWorkspace;

    idx = LPC_EMAC->RxConsumeIndex;
    RxLen = (RX_STAT_INFO(idx) & RINFO_SIZE) - 3;
    p->rptr = (TUInt16 *)RX_DESC_PACKET(idx);

    return RxLen;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_EndReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      End the last frame.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_EndReadFrame(void *aWorkspace)
{
    TUInt32 idx;

    // DMA free packet.
    idx = LPC_EMAC->RxConsumeIndex;
    if (++idx == NUM_RX_FRAG)
        idx = 0;
    LPC_EMAC->RxConsumeIndex = idx;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_RequestSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Requests space in EMAC memory for storing an outgoing frame
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_RequestSend(void *aWorkspace)
{
    T_LPC1788_EMAC_Workspace *p = (T_LPC1788_EMAC_Workspace *)aWorkspace;
    TUInt32 idx;

    idx = LPC_EMAC->TxProduceIndex;
    p->tptr = (TUInt16 *)TX_DESC_PACKET(idx);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_DoSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Send the frame
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      TUInt16 aFrameSize          -- Size of frame
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_DoSend(void *aWorkspace, TUInt16 aFrameSize)
{
    TUInt32 idx;

    idx = LPC_EMAC->TxProduceIndex;
    TX_DESC_CTRL(idx) = (aFrameSize - 1) | TCTRL_LAST; /*Corrected problem with the size, -1 was missing*/
    if (++idx == NUM_TX_FRAG)
        idx = 0;
    LPC_EMAC->TxProduceIndex = idx;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1788_WriteTxFrameData
 *---------------------------------------------------------------------------*
 * Description:
 *      Writes a word in little-endian byte order to TX_BUFFER
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      TUInt16 aData               -- Data to write
 *---------------------------------------------------------------------------*/
static void ILPC1788_WriteTxFrameData(
    T_LPC1788_EMAC_Workspace *p,
    TUInt16 aData)
{
    *(p->tptr++) = aData;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_CopyToFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from MCU-memory to frame port
 *      NOTES:
 *        - an odd number of byte may only be transfered
 *                  if the frame is written to the end!
 *        - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aSource               -- Location of data to send
 *      TUInt32 aSize               -- Number of bytes to send
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_CopyToFrame(void *aWorkspace, void *aSource, TUInt32 aSize)
{
    T_LPC1788_EMAC_Workspace *p = (T_LPC1788_EMAC_Workspace *)aWorkspace;
    TUInt16 *piSource;

