FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_EMAC.c
    piSource = aSource;
    aSize = (aSize + 1) & 0xFFFE; // round Size up to next even number
    while (aSize > 0) {
        ILPC1788_WriteTxFrameData(p, *piSource++);
        aSize -= 2;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1788_ReadRxFrameData
 *---------------------------------------------------------------------------*
 * Description:
 *      Reads a word in little-endian byte order from RX_BUFFER
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 * Outputs:
 *      TUInt16 aData               -- Data read
 *---------------------------------------------------------------------------*/
TUInt16 ILPC1788_ReadRxFrameData(T_LPC1788_EMAC_Workspace *p)
{
    return (*(p->rptr++));
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_CopyFromFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from frame port to MCU-memory
 *      NOTES:
 *          - an odd number of byte may only be transfered
 *              if the frame is read to the end!
 *          - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aDestination          -- Location to store data
 *      TUInt32 aSize               -- Number of bytes to copy
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_CopyFromFrame(
    void *aWorkspace,
    void *aDestination,
    TUInt32 aSize)
{
    T_LPC1788_EMAC_Workspace *p = (T_LPC1788_EMAC_Workspace *)aWorkspace;
    // Keil: Pointer added to correct expression
    TUInt16 *piDest;

    // Keil: Line added
    piDest = aDestination;
    while (aSize > 1) {
        *piDest++ = ILPC1788_ReadRxFrameData(p);
        aSize -= 2;
    }

    // check for leftover byte...
    if (aSize) {
        // the LAN-Controller will return 0 for the highbyte
        *(TUInt8 *)piDest = (TUInt8)ILPC1788_ReadRxFrameData(p);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      An interrupt on this EMAC has been received.  Catch it and
 *      possible pass it on to a callback routine.
 *---------------------------------------------------------------------------*/
static void LPC1788_EMAC_ProcessInterrupt(void)
{
    T_LPC1788_EMAC_Workspace *p = G_LPC1788_EMAC;
    TUInt32 status;

    // Clear the interrupt.
    status = LPC_EMAC->IntStatus;
    if (status & EMAC_INT_RXDONE) {
        if (p->iReceiveCallback) {
            p->iReceiveCallback(p->iReceiveCallbackWorkspace);
        }
    }
    // Clear any interrupts that triggered this code
    LPC_EMAC->IntClear = status;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_ISR
 *---------------------------------------------------------------------------*
 * Description:
 *      Stub to catch a EMAC interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( LPC1788_EMAC_ISR)
{
    IRQ_START();
    LPC1788_EMAC_ProcessInterrupt();
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_EnableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable interrupts to occur when packets are received by the EMAC
 *      instead of just polling for the data.  The given callback routine
 *      will be called per interrupt.  The callback routine is called
 *      from withing the interrupt routine, so it should merely set
 *      a flag, release a semaphore, or any other minimal processing, and
 *      return quickly.
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      T_uezEMACReceiveInterruptCallback aCallback -- Routine to call on
 *          interrupts.  Can be set to 0 for no processing.
 *      void *aCallbackWorkspace -- Workspace pointer to pass to callback
 *          or 0 for none.
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_EnableReceiveInterrupt(
    void *aWorkspace,
    T_uezEMACReceiveInterruptCallback aCallback,
    void *aCallbackWorkspace)
{
    T_LPC1788_EMAC_Workspace *p = (T_LPC1788_EMAC_Workspace *)aWorkspace;

    p->iReceiveCallback = aCallback;
    p->iReceiveCallbackWorkspace = aCallbackWorkspace;
    // Register this interrupt (if not already)
    InterruptRegister(ENET_IRQn, (TISRFPtr)LPC1788_EMAC_ISR,
        INTERRUPT_PRIORITY_HIGH, "EMAC");
    InterruptEnable(ENET_IRQn);
    // Turn on those types of interrupts
    LPC_EMAC->IntEnable = INT_RX_DONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_DisableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Disables receive interrupts from the EMAC.
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_DisableReceiveInterrupt(void *aWorkspace)
{
    // Turn off those types of interrupts
    LPC_EMAC->IntClear = INT_RX_DONE;
    // Turn off the whole interrutp since it is the only one
    InterruptEnable(ENET_IRQn);
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_EMAC G_LPC1788_EMAC_Interface = {
    {
        "LPC1788 EMAC",
        0x0100,
        LPC1788_EMAC_InitializeWorkspace,
        sizeof(T_LPC1788_EMAC_Workspace), },

    LPC1788_EMAC_Configure,
    LPC1788_EMAC_CheckFrameReceived,
    LPC1788_EMAC_StartReadFrame,
    LPC1788_EMAC_EndReadFrame,
    LPC1788_EMAC_RequestSend,
    LPC1788_EMAC_DoSend,
    LPC1788_EMAC_CopyToFrame,
    LPC1788_EMAC_CopyFromFrame,

