FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_EMAC.c
    // uEZ v1.10
    LPC1788_EMAC_EnableReceiveInterrupt,
    LPC1788_EMAC_DisableReceiveInterrupt,

};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Routine:  LPC1788_EMAC_RMII_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Creates the EMAC HAL driver for the LPC1788 device.  Also looks
 *      to see if it exists.  If found, sets the value in *aIsFound to ETrue.
 *      If NOT found, the value in *aIsFound IS NOT CHANGED!  Set *aIsFound
 *      to EFalse before calling this routine.
 * Inputs:
 *      T_LPC1788_EMAC_Settings *aSettings -- Settings to configure EMAC as
 *      TBool *aIsFound -- REturned flag if found
 *---------------------------------------------------------------------------*/
void LPC1788_EMAC_RMII_Require(const T_LPC1788_EMAC_Settings *aSettings)
{
    T_LPC1788_EMAC_Workspace *p;

    static const T_LPC1788_IOCON_ConfigList pinsTX_EN[] = { {
        GPIO_P1_4,
        IOCON_D_DEFAULT(1) }, // ENET_TX_EN
        };
    static const T_LPC1788_IOCON_ConfigList pinsTXD3[] = { {
        GPIO_P1_3,
        IOCON_D_DEFAULT(1) }, // ENET_TXD[3]
        };
    static const T_LPC1788_IOCON_ConfigList pinsTXD2[] = { {
        GPIO_P1_2,
        IOCON_D_DEFAULT(1) }, // ENET_TXD[2]
        };
    static const T_LPC1788_IOCON_ConfigList pinsTXD1[] = { {
        GPIO_P1_1,
        IOCON_D_DEFAULT(1) }, // ENET_TXD[1]
        };
    static const T_LPC1788_IOCON_ConfigList pinsTXD0[] = { {
        GPIO_P1_0,
        IOCON_D_DEFAULT(1) }, // ENET_TXD[0]
        };
    static const T_LPC1788_IOCON_ConfigList pinsTX_ER[] = { {
        GPIO_P1_5,
        IOCON_D_DEFAULT(1) }, // ENET_TX_ER
        };
    static const T_LPC1788_IOCON_ConfigList pinsTX_CLK[] = { {
        GPIO_P1_6,
        IOCON_D_DEFAULT(1) }, // ENET_TX_CLK
        };
    static const T_LPC1788_IOCON_ConfigList pinsRX_DV[] = { {
        GPIO_P1_13,
        IOCON_D_DEFAULT(1) }, // ENET_RX_DV
        };
    static const T_LPC1788_IOCON_ConfigList pinsRXD3[] = { {
        GPIO_P1_12,
        IOCON_D_DEFAULT(1) }, // ENET_RXD[3]
        };
    static const T_LPC1788_IOCON_ConfigList pinsRXD2[] = { {
        GPIO_P1_11,
        IOCON_D_DEFAULT(1) }, // ENET_RXD[2]
        };
    static const T_LPC1788_IOCON_ConfigList pinsRXD1[] = { {
        GPIO_P1_10,
        IOCON_D_DEFAULT(1) }, // ENET_RXD[1]
        };
    static const T_LPC1788_IOCON_ConfigList pinsRXD0[] = { {
        GPIO_P1_9,
        IOCON_D_DEFAULT(1) }, // ENET_RXD[0]
        };
    static const T_LPC1788_IOCON_ConfigList pinsRX_ER[] = { {
        GPIO_P1_14,
        IOCON_D_DEFAULT(1) }, // ENET_RX_ER
        };
    static const T_LPC1788_IOCON_ConfigList pinsRX_CLK[] = { {
        GPIO_P1_15,
        IOCON_D_DEFAULT(1) }, // ENET_RX_CLK
        };
    static const T_LPC1788_IOCON_ConfigList pinsCOL[] = { {
        GPIO_P1_7,
        IOCON_D_DEFAULT(1) }, // ENET_COL
        };
    static const T_LPC1788_IOCON_ConfigList pinsCRS[] = { {
        GPIO_P1_8,
        IOCON_D_DEFAULT(1) }, // ENET_CRS
        };
    // Use the MDC and MDIO pins as EMAC pins
    static const T_LPC1788_IOCON_ConfigList pinsMDC[] = {
        {   GPIO_P1_16, IOCON_D_DEFAULT(1)}, // ENET_MDC
        {   GPIO_P2_8, IOCON_D_DEFAULT(4)}, // ENET_MDC
    };
    static const T_LPC1788_IOCON_ConfigList pinsMDIO[] = {
        {   GPIO_P1_17, IOCON_D_DEFAULT(1)}, // ENET_MDIO
        {   GPIO_P2_9, IOCON_D_DEFAULT(4)}, // ENET_MDIO
    };
    HAL_DEVICE_REQUIRE_ONCE();

    // Register EMAC
    HALInterfaceRegister("EMAC", (T_halInterface *)&G_LPC1788_EMAC_Interface, 0,
        (T_halWorkspace **)&p);
    p->iPinSettings = *aSettings;
    LPC1788_IOCON_ConfigPin(aSettings->iTX_EN, pinsTX_EN,
        ARRAY_COUNT(pinsTX_EN));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iTXD3, pinsTXD3,
        ARRAY_COUNT(pinsTXD3));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iTXD2, pinsTXD2,
        ARRAY_COUNT(pinsTXD2));
    LPC1788_IOCON_ConfigPin(aSettings->iTXD1, pinsTXD1, ARRAY_COUNT(pinsTXD1));
    LPC1788_IOCON_ConfigPin(aSettings->iTXD0, pinsTXD0, ARRAY_COUNT(pinsTXD0));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iTX_ER, pinsTX_ER,
        ARRAY_COUNT(pinsTX_ER));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iTX_CLK, pinsTX_CLK,
        ARRAY_COUNT(pinsTX_CLK));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iRX_DV, pinsRX_DV,
        ARRAY_COUNT(pinsRX_DV));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iRXD3, pinsRXD3,
        ARRAY_COUNT(pinsRXD3));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iRXD2, pinsRXD2,
        ARRAY_COUNT(pinsRXD2));
    LPC1788_IOCON_ConfigPin(aSettings->iRXD1, pinsRXD1, ARRAY_COUNT(pinsRXD1));
    LPC1788_IOCON_ConfigPin(aSettings->iRXD0, pinsRXD0, ARRAY_COUNT(pinsRXD0));
    LPC1788_IOCON_ConfigPin(aSettings->iRX_ER, pinsRX_ER,
        ARRAY_COUNT(pinsRX_ER));
    LPC1788_IOCON_ConfigPin(aSettings->iRX_CLK, pinsRX_CLK,
        ARRAY_COUNT(pinsRX_CLK));
    LPC1788_IOCON_ConfigPinOrNone(aSettings->iCOL, pinsCOL,
        ARRAY_COUNT(pinsCOL));
    LPC1788_IOCON_ConfigPin(aSettings->iCRS, pinsCRS, ARRAY_COUNT(pinsCRS));
    LPC1788_IOCON_ConfigPin(aSettings->iMDC, pinsMDC, ARRAY_COUNT(pinsMDC));
    LPC1788_IOCON_ConfigPin(aSettings->iMDIO, pinsMDIO, ARRAY_COUNT(pinsMDIO));

#if EMAC_USE_BITBANG_MDIO_DETECT
    p->iMDIOSettings.iDelayUSPerHalfBit = EMAC_BITBANG_MDIO_DELAY_US;
    p->iMDIOSettings.iIsClause45 = EFalse;
    p->iMDIOSettings.iPinMDC = aSettings->iMDC;
    p->iMDIOSettings.iPinMDIO = aSettings->iMDIO;
    if (LPC1788_EMAC_DetectEMAC(p) == UEZ_ERROR_NONE)
        p->iIsDetected = ETrue;
#else
    p->iIsDetected = ETrue;
#endif
}

/*-------------------------------------------------------------------------*
 * End of File:  EMAC.c
 *-------------------------------------------------------------------------*/
